{
    "presidents": [
        {
	    "rank": 1,
            "name": "George Washington",		
            "dates": "1789-1797",
            "notes": "George Washington was the first President of the United States, the Commander-in-Chief of the Continental Army during the American Revolutionary War, and one of the Founding Fathers of the United States. He presided over the convention that drafted the United States Constitution. He was widely admired for his strong leadership qualities and was unanimously elected president by the Electoral College in the first two national elections. He oversaw the creation of a strong, well-financed national government that maintained neutrality in the French Revolutionary Wars, suppressed the Whiskey Rebellion, and won acceptance among Americans of all types. His incumbency established many precedents still in use today, such as the cabinet system, the inaugural address, and the title Mr. President. His retirement from office after two terms established a tradition that lasted until 1940, when Franklin Delano Roosevelt won an unprecedented third term. The 22nd Amendment (1951) now limits the president to two elected terms. He was born into the provincial gentry of Colonial Virginia to a family of wealthy planters who owned tobacco plantations and slaves, which he inherited. In his youth, he became a senior officer in the colonial militia during the first stages of the French and Indian War. In 1775, the Second Continental Congress commissioned Washington as commander-in-chief of the Continental Army in the American Revolution. In that command, Washington forced the British out of Boston in 1776, but was defeated and nearly captured later that year when he lost New York City. After crossing the Delaware River in the middle of winter, he defeated the British in two battles (Trenton and Princeton), retook New Jersey, and restored momentum to the Patriot cause. His strategy enabled Continental forces to capture two major British armies at Saratoga in 1777 and Yorktown in 1781. Historians laud Washington for the selection and supervision of his generals; preservation and command of the army; coordination with the Congress, state governors, and their militia; and attention to supplies, logistics, and training. In battle, however, Washington was repeatedly outmaneuvered by British generals with larger armies. After victory had been finalized in 1783, Washington resigned as commander-in-chief rather than seize power, proving his opposition to dictatorship and his commitment to American republicanism. Washington presided over the Constitutional Convention in 1787, which devised a new form of federal government for the United States. Following his election as president in 1789, he worked to unify rival factions in the fledgling nation. He supported Alexander Hamilton's programs to satisfy all debts, federal and state, established a permanent seat of government, implemented an effective tax system, and created a national bank. In avoiding war with Great Britain, he guaranteed a decade of peace and profitable trade by securing the Jay Treaty in 1795, despite intense opposition from the Jeffersonians. He remained non-partisan, never joining the Federalist Party, although he largely supported its policies. Washington's Farewell Address was an influential primer on civic virtue, warning against partisanship, sectionalism, and involvement in foreign wars. He retired from the presidency in 1797, returning to his home and plantation at Mount Vernon. While Washington was in power, his use of national authority pursued many ends, especially the preservation of liberty, reduction of regional tensions, and promotion of a spirit of American nationalism. He has been depicted and remembered in monuments, currency, and other dedications to the present day."
        },
        {
	    "rank": 2,
            "name": "John Adams",
            "dates": "1797-1801",
            "notes": "John Adams was an American lawyer, author, statesman, and diplomat. He served as the second President of the United States (1797 to 1801) and the first Vice President (1789 to 1797) and, as a Founding Father, he was a leader of American independence from Great Britain. Adams was a political theorist in the Age of Enlightenment who promoted republicanism and a strong central government. His innovative ideas were frequently published. He was also a dedicated diarist and correspondent, particularly with his wife and key advisor Abigail. He collaborated with his cousin, revolutionary leader Samuel Adams, but he established his own prominence prior to the American Revolution. After the Boston Massacre, he provided a successful (though unpopular) legal defense of the accused British soldiers, in the face of severe local anti British sentiment and driven by his devotion to the right to counsel and the protection of innocence. Adams was a delegate from Massachusetts to the Continental Congress, where he played a leading role in persuading Congress to declare independence. He assisted Thomas Jefferson in drafting the Declaration of Independence in 1776, and was its foremost advocate in the Congress. As a diplomat in Europe, he helped negotiate the eventual peace treaty with Great Britain, and acquired vital governmental loans from Amsterdam bankers. Adams was the primary author of the Massachusetts Constitution in 1780 which influenced American political theory, as did his earlier Thoughts on Government (1776). Adam's credentials as a revolutionary secured for him two terms as President George Washington's vice president (1789 to 1797) and also his own election in 1796 as the second president. In his single term as president, he encountered fierce criticism from the Jeffersonian Republicans, as well as the dominant faction in his own Federalist Party, led by his rival Alexander Hamilton. Adams signed the controversial Alien and Sedition Acts, and built up the army and navy in the face of an undeclared naval Quasi War with France. The major accomplishment of his presidency was a peaceful resolution of the conflict in the face of Hamilton's opposition. Due to his strong posture on defense, Adams is often called the father of the American Navy. He was the first U.S. president to reside in the executive mansion, now known as the White House. In 1800, Adams lost reelection to Thomas Jefferson and retired to Massachusetts. He eventually resumed his friendship with Jefferson upon the latter's own retirement by initiating a correspondence which lasted fourteen years. He and his wife established a family of politicians, diplomats, and historians now referred to as the Adams political family. Adams was the father of John Quincy Adams, the sixth President of the United States. He died on the fiftieth anniversary of the adoption of the Declaration of Independence. Modern historians in the aggregate have favorably ranked his administration."
        },
        {
	    "rank": 3,
            "name": "Thomas Jefferson",
            "dates": "1801-1809",
            "notes": "Thomas Jefferson was an American Founding Father and the principal author of the Declaration of Independence (1776). He was elected the second Vice President of the United States (1797 to 1801), serving under John Adams and was elected the third President (1801 to 1809) in 1800. Jefferson was a proponent of democracy, republicanism, and individual rights, which motivated American colonists to break from Great Britain and form a new nation. He produced formative documents and decisions at both the state and national level. Jefferson was primarily of English ancestry, born and educated in Virginia. He graduated from the College of William & Mary and briefly practiced law, at times defending slaves seeking their freedom. During the American Revolution, he represented Virginia in the Continental Congress that adopted the Declaration, drafted the law for religious freedom as a Virginia legislator, and served as a wartime governor (1779 to 1781). He became the United States Minister to France in May 1785, and subsequently the nation's first Secretary of State in 1790 to 1793 under President George Washington. Jefferson and James Madison organized the Democratic Republican Party to oppose the Federalist Party during the formation of the First Party System. With Madison, he anonymously wrote the Kentucky and Virginia Resolutions in 1798 to 1799, which sought to embolden state's rights in opposition to the national government by nullifying the Alien and Sedition Acts. As President, Jefferson pursued the nation's shipping and trade interests against Barbary pirates and aggressive British trade policies. He also organized the Louisiana Purchase, almost doubling the country's territory. As a result of peace negotiations with France, his administration reduced military forces. He was reelected in 1804. Jefferson's second term was beset with difficulties at home, including the trial of former Vice President Aaron Burr. American foreign trade was diminished when Jefferson implemented the Embargo Act of 1807, responding to British threats to U.S. shipping. In 1803, Jefferson began a controversial process of Indian tribe removal to the newly organized Louisiana Territory, and he signed the Act Prohibiting Importation of Slaves in 1807. Jefferson mastered many disciplines, which ranged from surveying and mathematics to horticulture and mechanics. He was a proven architect in the classical tradition. Jefferson's keen interest in religion and philosophy earned him the presidency of the American Philosophical Society. He shunned organized religion, but was influenced by both Christianity and deism. He was well versed in linguistics and spoke several languages. He founded the University of Virginia after retiring from public office. He was a prolific letter writer and corresponded with many prominent and important people throughout his adult life. His only full length book is Notes on the State of Virginia (1785), considered the most important American book published before 1800. Jefferson owned several plantations which were worked by hundreds of slaves. Most historians now believe that, after the death of his wife in 1782, he had a relationship with his slave Sally Hemings and fathered at least one of her children. Historians have lauded Jefferson's public life, noting his primary authorship of the Declaration of Independence during the Revolutionary War, his advocacy of religious freedom and tolerance in Virginia, and the Louisiana Purchase while he was president. Various modern scholars are more critical of Jefferson's private life, pointing out the discrepancy between his ownership of slaves and his liberal political principles, for example. Presidential scholars consistently rank Jefferson among the greatest presidents."
        },
        {
	    "rank": 4,
            "name": "James Madison Jr",
            "dates": "1809-1817",
            "notes": "James Madison Jr. was an American political theorist and statesman, who served as the fourth President of the United States from 1809 to 1817. He is hailed as the Father of the Constitution for his pivotal role in drafting and promoting the United States Constitution and the Bill of Rights. Madison inherited his plantation Montpelier in Virginia and owned hundreds of slaves during his lifetime. He served as both a member of the Virginia House of Delegates and as a member of the Continental Congress prior to the Constitutional Convention. After the Convention, he became one of the leaders in the movement to ratify the Constitution, both nationally and in Virginia. His collaboration with Alexander Hamilton and John Jay produced The Federalist Papers, among the most important treatises in support of the Constitution. Madison changed his political views during his life. During deliberations on the constitution, he favored a strong national government, but later preferred stronger state governments, before settling between the two extremes late in his life. In 1789, Madison became a leader in the new House of Representatives, drafting many basic laws. He is noted for drafting the first ten amendments to the Constitution, and thus is known also as the Father of the Bill of Rights. He worked closely with President George Washington to organize the new federal government. Breaking with Hamilton and the Federalist Party in 1791, he and Thomas Jefferson organized the Democratic Republican Party. In response to the Alien and Sedition Acts, Jefferson and Madison drafted the Kentucky and Virginia Resolutions arguing that states can nullify unconstitutional laws. As Jefferson's Secretary of State (1801 to 1809), Madison supervised the Louisiana Purchase, which doubled the nation's size. Madison succeeded Jefferson as President in 1809, was reelected in 1813, and presided over renewed prosperity for several years. After the failure of diplomatic protests and a trade embargo against the United Kingdom, he led the U.S. into the War of 1812. The war was an administrative morass, as the United States had neither a strong army nor financial system. As a result, Madison afterward supported a stronger national government and a strong military, as well as the national bank, which he had long opposed."
        },
        {
	    "rank": 5,
            "name": "James Monroe",
            "dates": "1817-1825",
            "notes": "James Monroe was the fifth President of the United States, serving between 1817 and 1825. Monroe was the last president who was a Founding Father of the United States and the last president from the Virginian dynasty and the Republican Generation. Born in Westmoreland County, Virginia, Monroe was of the planter class and fought in the American Revolutionary War. He was wounded in the Battle of Trenton with a musket ball to his shoulder. After studying law under Thomas Jefferson from 1780 to 1783, he served as a delegate in the Continental Congress. As an anti federalist delegate to the Virginia convention that considered ratification of the United States Constitution, Monroe opposed ratification, claiming it gave too much power to the central government. He took an active part in the new government, and in 1790 he was elected to the Senate of the first United States Congress, where he joined the Democratic Republicans. He gained experience as an executive as the Governor of Virginia and rose to national prominence as a diplomat in France, when he helped negotiate the Louisiana Purchase in 1803. During the War of 1812, Monroe held the critical roles of Secretary of State and the Secretary of War under President James Madison. Facing little opposition from the fractured Federalist Party, Monroe was easily elected president in 1816, winning over 80 percent of the electoral vote and becoming the last president during the First Party System era of American politics. As president, he bought Florida from Spain and sought to ease partisan tensions, embarking on a tour of the country that was generally well received. With the ratification of the Treaty of 1818, under the successful diplomacy of his Secretary of State John Quincy Adams, the United States extended from the Atlantic to the Pacific, giving America harbor and fishing rights in the Pacific Northwest. The United States and Britain jointly occupied the Oregon Country. In addition to the acquisition of Florida, the landmark Treaty of 1819 secured the border of the United States along the 42nd Parallel to the Pacific Ocean and represented America's first determined attempt at creating an American global empire. As nationalism surged, partisan fury subsided and the Era of Good Feelings ensued until the Panic of 1819 struck and dispute over the admission of Missouri embroiled the country in 1820. Nonetheless, Monroe won near unanimous reelection. Monroe supported the founding of colonies in Africa for freed slaves that would eventually form the nation of Liberia, whose capital, Monrovia, is named in his honor. In 1823, he announced the United States opposition to any European intervention in the recently independent countries of the Americas with the Monroe Doctrine, which became a landmark in American foreign policy. His presidency concluded the first period of American presidential history before the beginning of Jacksonian democracy and the Second Party System era. Following his retirement in 1825, Monroe was plagued by financial difficulties. He died in New York City on July 4, 1831."
        },
        {
	    "rank": 6,
            "name": "John Quincy Adams",
            "dates": "1825-1829",
            "notes": "John Quincy Adams was an American statesman who served as the sixth President of the United States from 1825 to 1829. He also served as a diplomat, a Senator and member of the House of Representatives. He was a member of the Federalist, Democratic Republican, National Republican, and later Anti Masonic and Whig parties. In his biography, Samuel Flagg Bemis argues that Adams was able to gather together, formulate, and practice the fundamentals of American foreign policy, self determination, independence, noncolonization, nonintervention, nonentanglement in European politics, Freedom of the Seas, and freedom of commerce. John Quincy Adams was the son of President John Adams and Abigail Adams. As a diplomat, Adams played an important role in negotiating key treaties, most notably the Treaty of Ghent, which ended the War of 1812. As Secretary of State, he negotiated with Britain over the United States northern border with Canada, negotiated with Spain the annexation of Florida, and drafted the Monroe Doctrine. Historians agree he was one of the greatest diplomats and secretaries of state in American history. Adams was elected president in a close and controversial four way contest in 1824. As president he sought to modernize the American economy and promote education. Adams enacted a part of his agenda and paid off much of the national debt. However he was stymied time and again by a Congress controlled by his enemies, and his lack of patronage networks helped politicians eager to undercut him. He lost his 1828 bid for re election to Andrew Jackson. Adams is best known as a diplomat who shaped U.S. foreign policy in line with his ardently nationalist commitment to U.S. republican values. More recently, he has been portrayed as the exemplar and moral leader in an era of modernization. During Adam's lifetime, technological innovations and new means of communication spread messages of religious revival, social reform, and party politics. Goods, money, and people traveled more rapidly and efficiently than ever before. Adams was elected as U.S. Representative from Massachusetts after leaving office, serving for the last 17 years of his life with far greater acclaim than he had achieved as president. Animated by his growing revulsion against slavery, Adams became a leading opponent of the Slave Power. He predicted that if a civil war were to break out, the president could abolish slavery by using his war powers. Adams also predicted the Union's dissolution over the slavery issue, but said that if the South became independent there would be a series of bloody slave revolts."
        },
        {
	    "rank": 7,
            "name": "Andrew Jackson",
            "dates": "1829-1837",
            "notes": "Andrew Jackson was an American statesman who served as the seventh President of the United States from 1829 to 1837 and is considered the founder of the Democratic Party. He was born near the end of the colonial era, somewhere near the then unmarked border between North and South Carolina, into a recently immigrated Scots Irish farming family of relatively modest means. During the American Revolutionary War, Jackson, whose family supported the revolutionary cause, acted as a courier. At age 13, he was captured and mistreated by the British army. He later became a lawyer. He was also elected to Congressional office, first to the U.S. House of Representatives and twice to the U.S. Senate. In 1801, Jackson was appointed colonel in the Tennessee militia, which became his political as well as military base. He owned hundreds of slaves who worked on the Hermitage Plantation. In 1806, he killed a man in a duel over a matter of honor regarding his wife Rachel. He gained national fame through his role in the War of 1812, most famously where he won a decisive victory over the main British invasion army at the Battle of New Orleans. In response to conflict with the Seminole in Spanish Florida, he invaded the territory in 1818. This led directly to the First Seminole War and the Adams Onis Treaty of 1819, which formally transferred Florida from Spain to the United States. After winning election to the Senate, Jackson decided to run for president in 1824. Although he got a plurality in both electoral and popular vote against three major candidates, Jackson failed to get a majority and lost in the House of Representatives to John Quincy Adams. Jackson claimed that he lost by a corrupt bargain between Adams and Speaker of the House Henry Clay, who was also a candidate, to give Clay the office of Secretary of State in exchange for Adams winning the presidency. Jackson's supporters then founded what became the Democratic Party. He ran again for president in 1828 against Adams. Building on his base in the West and with new support from Virginia and New York, he won by a landslide. He blamed the death of his wife, Rachel, which occurred just after the election, on the Adams campaigners, who called her a bigamist. As president, Jackson faced a threat of secession by South Carolina over the Tariff of Abominations, which Congress had enacted under Adams. In contrast to several of his immediate successors, he denied the right of a state to secede from the union or to nullify federal law. The Nullification Crisis was defused when the tariff was amended and Jackson threatened the use of military force if South Carolina attempted to secede. In anticipation of the 1832 election, Congress, led by Clay, attempted to reauthorize the Second Bank of the United States four years before the expiration of its charter. In keeping with his platform of economic decentralization, Jackson vetoed the renewal of its charter, thereby seemingly putting his chances for reelection in jeopardy. However, by portraying himself as the defender of the common person against wealthy bankers, he was able to defeat Clay in the election that year. He thoroughly dismantled the bank by the time its charter expired in 1836. His struggles with Congress were personified in his personal rivalry with Clay, whom Jackson deeply disliked and who led the opposition of the emerging Whig Party. Jackson's presidency marked the beginning of the ascendancy of the spoils system in American politics. He is also known for having signed the Indian Removal Act in 1830, which forcibly relocated a number of native tribes in the South to Indian Territory (now Oklahoma). Jackson supported his vice president Martin Van Buren's successful presidential campaign in 1836. He worked to bolster the Democratic Party and helped his friend James K. Polk win the 1844 presidential election."
        },

        {
	    "rank": 8,
            "name": "Martin Van Buren",
            "dates": "1837-1841",
            "notes": "Martin Van Buren was an American politician who served as the eighth President of the United States (1837 to 1841). A member of the Democratic Party, he served in a number of senior roles, including eighth Vice President (1833 to 1837) and tenth Secretary of State (1829 to 1831), both under Andrew Jackson. Van Buren's inability as president to deal with the deep economic depression following the Panic of 1837 and with the surging Whig Party led to his defeat in the 1840 election. Of Dutch ancestry, Van Buren learned early to interact with people from multiple ethnic, income, and societal groups, which he used to his advantage as a political organizer. A meticulous dresser, he could mingle in upper class society as well as in saloon environments like the tavern his father ran. A delegate to a political convention at age 18, he quickly moved from local to state politics, gaining fame both as a political organizer and an accomplished lawyer. Elected to the Senate by the state legislature in 1821, Van Buren supported William H. Crawford for president in the 1824 election, but by 1828 had come to support General Andrew Jackson. Van Buren was a major supporter and organizer for Jackson in the 1828 election. Jackson was elected, and made Van Buren Secretary of State. During Jackson's eight years as president, Van Buren was a key advisor, and built the organizational structure for the coalescing Democratic Party, particularly in New York. In 1831, following his resignation as Secretary of State, Jackson gave Van Buren a recess appointment as American minister to Britain, but Van Buren's nomination was rejected by the Senate, cutting short his service in London. He was successful in the jockeying to become Jackson's picked successor, and was elected vice president in 1832. Van Buren defeated several Whig opponents in 1836, and was elected president. As president, Van Buren was blamed for the depression of 1837; hostile newspapers called him Martin Van Ruin. He attempted to cure the economic problems by keeping control of federal funds in an independent treasury rather than in state banks but Congress would not approve of this until 1840. In foreign affairs, he denied the application of Texas for admission to the Union, unwilling to upset the balance of free and slave states in the Missouri Compromise, and hoping to avoid war with Mexico over Texas annexation by purchasing the territory from Mexico's government. Additionally, relations with Britain and its colonies in Canada proved to be strained from the bloodless Aroostook War and the Caroline Affair. In 1840, Van Buren was voted out of office, losing to Whig candidate William Henry Harrison. Van Buren was the leading candidate for the Democratic nomination in 1844, but lost to James K. Polk, who went on to win the election. In the 1848 election Van Buren ran unsuccessfully as the candidate of the anti slavery Free Soil Party. He returned to the Democratic fold to support Franklin Pierce (1852), James Buchanan (1856), and Stephen A. Douglas (1860) for the presidency, but his increasingly abolitionist views and support for the Union led him to support Abraham Lincoln's policies after the start of the American Civil War. Van Buren's health began to fail in 1861, and he died in July 1862 at the age of seventy nine. Although he served in many high offices, his most lasting achievement was as a political organizer who built the modern Democratic Party and guided it to dominance in the new Second Party System."
        },
        {
	    "rank": 9,
            "name": "William Henry Harrison",
            "dates": "1841-1841",
            "notes": "William Henry Harrison, Sr. was the ninth President of the United States (1841), an American military officer and politician, and the last president born as a British subject. He was also the first president to die in office. He was 68 years, 23 days old when inaugurated, the oldest president to take office until Ronald Reagan in 1981. Harrison died on his 32nd day in office of complications from pneumonia, serving the shortest tenure in United States presidential history. His death sparked a brief constitutional crisis, but its resolution left unsettled many questions following the presidential line of succession in regard to Constitution until the passage of the 25th Amendment in 1967. He was the grandfather of Benjamin Harrison, who served as the 23rd President from 1889 to 1893. Before election as president, Harrison served as the first territorial congressional delegate from the Northwest Territory, as governor of the Indiana Territory, and later as a U.S. representative and senator from Ohio. He originally gained national fame for leading U.S. forces against American Indians at the Battle of Tippecanoe in 1811, where he earned the nickname Tippecanoe (or Old Tippecanoe). As a general in the subsequent War of 1812, his most notable action was in the Battle of the Thames in 1813. This battle resulted in the death of Tecumseh and the dissolution of the Indian coalition which he led. After the war, Harrison moved to Ohio, where he was elected to the United States House of Representatives. In 1824, the state legislature elected him to the U.S. Senate. He served a truncated term after being appointed as Minister Plenipotentiary to Gran Colombia in May 1828. In Santa Fe de Bogota, he spoke with president Simon Bolivar, urging his nation to adopt American style democracy. Returning to his farm in Ohio, Harrison lived in relative retirement until he was nominated for the presidency as one of several Whig Party candidates in the election of 1836. He received more votes than any other Whig, but was defeated by Democrat Martin Van Buren. He retired again to his farm. Van Buren soon became a major target of criticism from the Whigs surrounding economic difficulties following the Panic of 1837. Seeking to run a non controversial and less ideological war hero who could defeat Van Buren based on popularity, a unified Whig Party nominated Harrison over party founder Henry Clay and fellow general Winfield Scott. John Tyler of Virginia was selected as his running mate. Harrison and Tyler defeated Van Buren in the 1840 election. However, Harrison died of pneumonia in April 1841, a month after taking office. He had the shortest tenure of any president in history, and was the first president to die in office. Tyler then assumed all of the powers and duties of the president, setting a major precedent."
        },
        {
	    "rank": 10,
            "name": "Jon Tyler",
            "dates": "1841-1845",
            "notes": "John Tyler was the tenth President of the United States (1841 to 1845). He was also, briefly, the tenth Vice President (1841), elected to that office on the 1840 Whig ticket with William Henry Harrison. Tyler became president after Harrison's death in April 1841, only a month after the start of the new administration. Known to that point as a supporter of state's rights, which endeared him to his fellow Virginians, his actions as president showed that he was willing to back nationalist policies as long as they did not infringe on the powers of the states. Still, the circumstances of his unexpected rise to the presidency, and its threat to the presidential ambitions of Henry Clay and other politicians, left him estranged from both major parties. A firm believer in manifest destiny, President Tyler sought to strengthen and preserve the Union through territorial expansion, most notably the annexation of the independent Republic of Texas in his last days in office. Tyler, born to an eminent Virginia family, came to national prominence at a time of political upheaval. In the 1820s the nation's only political party, the Democratic Republicans, split into factions. Though initially a Democrat, his opposition to Andrew Jackson and Martin Van Buren led him to ally with the Whig Party. Tyler served as a Virginia state legislator, governor, U.S. representative, and U.S. senator before his election as vice president in the presidential election of 1840. He was put on the ticket to attract state's rights Southerners to what was then a Whig coalition to defeat Van Buren's reelection bid. Harrison's death made Tyler the first vice president to succeed to the presidency without being elected to the office. Because of the short duration of Harrison's one month term, Tyler served longer than any president in U.S. history who was never elected to the office. To forestall constitutional uncertainty, Tyler immediately took the oath of office, moved into the White House, and assumed full presidential powers, a precedent that would govern future successions and eventually become codified in the Twenty fifth Amendment. A strict constructionist, Tyler found much of the Whig platform unconstitutional, and vetoed several of his party's bills. Believing that the president should set policy instead of deferring to Congress, he attempted to bypass the Whig establishment, most notably Kentucky Senator Henry Clay. Most of Tyler's Cabinet resigned soon into his term, and the Whigs, dubbing him His Accidency, expelled him from the party. Though Tyler was not the first president to veto bills, he was the first to see his veto overridden by Congress. Although he faced a stalemate on domestic policy, he had several foreign policy achievements, including the Webster Ashburton Treaty with Britain and the Treaty of Wanghia with Qing China. President Tyler dedicated his last two years in office to the annexation of Texas. He initially sought election to a full term as president, but after failing to gain the support of either Whigs or Democrats, he withdrew. In the last days of his term, Congress passed the resolution authorizing the Texas annexation, which was carried out by Tyler's successor, James K. Polk. When the American Civil War began in 1861, Tyler sided with the Confederate government, and won election to the Confederate House of Representatives shortly before his death. Although some have praised Tyler's political resolve, his presidency is generally held in low esteem by historians; today he is considered an obscure president, with little presence in the American cultural memory."
        },
        {
	    "rank": 11,
            "name": "James K. Polk",
            "dates": "1845-1849",
            "notes": "James Knox Polk was the 11th President of the United States (1845 to 1849). Polk was born in Mecklenburg County, North Carolina. He later lived in and represented Tennessee. A Democrat, Polk served as the 13th Speaker of the House of Representatives (1835 to 1839) the only president to have served as House Speaker and the first of two people (the other being Andrew Johnson) to served as Governor of Tennessee (1839 to 1841). Polk was the surprise (dark horse) candidate for president in 1844, defeating Henry Clay of the rival Whig Party by promising to annex the Republic of Texas. Polk was a leader of Jacksonian Democracy during the Second Party System. Polk is often considered the last strong pre Civil War president, having met during his four years in office every major domestic and foreign policy goal set during his campaign and the transition to his administration. When Mexico rejected the U.S. annexation of Texas (which Mexico considered part of its territory, despite the 1836 Texas Revolution), Polk led the nation to a sweeping victory in the Mexican American War, which resulted in the cession by Mexico of nearly the whole of what is now the American Southwest. He ensured a substantial reduction of tariff rates by replacing the Black Tariff with the Walker tariff of 1846, which pleased the less industrialized states of his native South by rendering less expensive both imported and, through competition, domestic goods. He threatened war with the United Kingdom over the issue of which nation owned the Oregon Country, eventually reaching a settlement in which the British were made to sell the portion that became the Oregon Territory. Additionally, he built an independent treasury system that lasted until 1913, oversaw the opening of the U.S. Naval Academy and of the Smithsonian Institution, the groundbreaking for the Washington Monument, and the issuance of the first United States postage stamp. True to his campaign pledge to serve only one term as President, Polk left office and returned to Tennessee in March 1849. He died of cholera three months later. Scholars have ranked him favorably on lists of greatest presidents for his ability to promote, obtain support for, and achieve all of the major items on his presidential agenda. Polk has been called the least known consequential president of the United States."
        },
        {
	    "rank": 12,
            "name": "Zachary Taylor",
            "dates": "1949-1850",
            "notes": "Zachary Taylor was the 12th President of the United States, serving from March 1849 until his death in July 1850. Before his presidency, Taylor was a career officer in the United States Army, rising to the rank of major general. Taylor's status as a national hero as a result of his victories in the Mexican American War won him election to the White House despite his vague political beliefs. His top priority as president was preserving the Union, but he died seventeen months into his term, before making any progress on the status of slavery, which had been inflaming tensions in Congress. Taylor was born into a prominent family of planters who migrated westward from Virginia to Kentucky in his youth. Taylor was commissioned as an officer in the U.S. Army in 1808 and made a name for himself as a captain in the War of 1812. He climbed the ranks establishing military forts along the Mississippi River and entered the Black Hawk War as a colonel in 1832. His success in the Second Seminole War attracted national attention and earned him the nickname Old Rough and Ready. In 1845, as the annexation of Texas was underway, President James K. Polk dispatched Taylor to the Rio Grande area in anticipation of a potential battle with Mexico over the disputed Texas Mexico border. The Mexican American War broke out in April 1846. In May, Taylor defeated Mexican troops commanded by General Mariano Arista at the Battles of Palo Alto and Resaca de la Palma, and managed to drive his troops out of Texas. Taylor subsequently led his troops into Mexico, where they once again defeated Mexican troops commanded by Pedro de Ampudia at the Battle of Monterrey in September. Taylor subsequently defied orders by moving his troops further south, where, despite being severely outnumbered, he dealt a crushing blow to Mexican forces under Antonio López de Santa Anna in February 1847 at the Battle of Buena Vista. After this, most of Taylor's troops were transferred to the command of Major General Winfield Scott, but Taylor's popularity remained significant. The Whig Party convinced the reluctant Taylor to lead their ticket, despite his unclear platform and lack of interest in politics. He won the election alongside New York politician Millard Fillmore, defeating Democratic candidates Lewis Cass and William Orlando Butler, as well as a third party effort led by former President Martin Van Buren and Charles Francis Adams, Sr. of the Free Soil Party. As president, Taylor kept his distance from Congress and his cabinet, even as partisan tensions threatened to divide the Union. Debate over the slave status of the large territories claimed in the war led to threats of secession from Southerners. Despite being a Southerner and a slaveholder himself, Taylor did not push for the expansion of slavery. To avoid the question, he urged settlers in New Mexico and California to bypass the territorial stage and draft constitutions for statehood, setting the stage for the Compromise of 1850. Taylor died suddenly of a stomach related illness in July 1850, so had little impact on the sectional divide that led to civil war a decade later."
        },
        {
	    "rank": 13,
            "name": "Millard Fillmore",
            "dates": "1850-1853",
            "notes": "Millard Fillmore was an American statesman who served as the 13th President of the United States from 1850 to 1853. He was the last Whig president, and the last president not to be affiliated with either the Democratic or Republican parties. Fillmore was the only Whig president who did not die in office or get expelled from the party, and Fillmore appointed the only Whig Supreme Court Justice. As Zachary Taylor's vice president, he assumed the presidency after Taylor's death. Fillmore was a lawyer from western New York state, and an early member of the Whig Party. He served in the state legislature (1829 to 1831), as a U.S. Representative (1833 to 1835, 1837 to 1843), and as New York State Comptroller (1848 to 1849). He was elected vice president of the United States in 1848 as Taylor's running mate, and served from 1849 until Taylor's death in 1850, at the height of the Crisis of 1850 over slavery. As an anti slavery moderate, he opposed abolitionist demands to exclude slavery from all the territory gained in the Mexican War. Instead he supported the Compromise of 1850, which briefly ended the crisis. In foreign policy, Fillmore supported U.S. Navy expeditions to open trade in Japan, opposed French designs on Hawaii, and was embarrassed by Narciso Lopez's filibuster expeditions to Cuba. He sought election to a full term in 1852, but was passed over for the nomination by the Whigs. When the Whig Party broke up in 1854 to 1856, Fillmore refused to join the Republican Party. Unlike many other conservative Whigs, Fillmore did not join the American Party, the political arm of the anti immigrant, anti Catholic Know Nothing movement. While out of the country, he was nevertheless nominated by the American Party as their candidate for President in 1856. He finished third in the election, surpassed by the Republican Party candidate. During the American Civil War, Fillmore denounced secession and agreed that the Union must be maintained by force if necessary, but was very critical of the war policies of President Abraham Lincoln. After the war, he supported the Reconstruction policies of President Andrew Johnson. Although some have praised Fillmore's restrained foreign policy, he is criticized for having further aggravated tensions between abolitionists and slaveholders. He is placed near the bottom 10 of historical rankings of Presidents of the United States by various scholarly surveys. Fillmore founded the University at Buffalo and was the university's first chancellor. He also helped found the Buffalo Historical Society and the Buffalo General Hospital."
        },
        {
	    "rank": 14,
            "name": "Franklin Pierce",
            "dates": "1853-1857",
            "notes": "Franklin Pierce was the 14th President of the United States (1853 to 1857). Pierce was a northern Democrat who saw the abolitionist movement as a fundamental threat to the unity of the nation. His polarizing actions in championing and signing the Kansas Nebraska Act and enforcing the Fugitive Slave Act failed to stem intersectional conflict, setting the stage for Southern secession. Born in New Hampshire, Pierce served in the U.S. House of Representatives and the Senate until he resigned from the latter in 1842. His private law practice in his home state was a success; he was appointed U.S. Attorney for his state in 1845. Pierce took part in the Mexican American War as a brigadier general in the Army. Seen by Democrats as a compromise candidate uniting northern and southern interests, he was nominated as the party's candidate for president on the 49th ballot at the 1852 Democratic National Convention. In the 1852 presidential election, Pierce and his running mate William R. King easily defeated the Whig Party ticket of Winfield Scott and William A. Graham. While Pierce was popular and outgoing, his family life was a grim affair, with his wife Jane suffering from illness and depression for much of her life. All of their children died young, their last son being gruesomely killed in a train accident while the family was traveling shortly before Pierce's inauguration. As president, Pierce simultaneously attempted to enforce neutral standards for civil service while also satisfying the diverse elements of the Democratic Party with patronage, an effort which largely failed and turned many in his party against him. Pierce was a Young America expansionist who signed the Gadsden Purchase of land from Mexico and led a failed attempt to acquire Cuba from Spain. He signed trade treaties with Britain and Japan, while his Cabinet reformed their departments and improved accountability, but these successes were overshadowed by political strife. His popularity in the Northern states declined sharply after he supported the Kansas Nebraska Act, which nullified the Missouri Compromise, while many whites in the South continued to support him. Passage of the act led to violent conflict over the expansion of slavery in the American West. Pierce's administration was further damaged when several of his diplomats issued the Ostend Manifesto, calling for the annexation of Cuba, a document which was roundly criticized. Although Pierce fully expected to be renominated by the Democrats in the 1856 presidential election, he was abandoned by his party and his bid failed. His reputation in the North suffered further during the Civil War as he became a vocal critic of President Abraham Lincoln. Pierce, who had been a heavy drinker for much of his life, died of severe cirrhosis of the liver in 1869. US historians and other political commentators generally rank Pierce's presidency among the worst."
        },
        {
	    "rank": 15,
            "name": "James Buchanan",
            "dates": "1857-1861",
            "notes": "James Buchanan, Jr. was the 15th President of the United States (1857 to 1861), serving immediately prior to the American Civil War. He represented Pennsylvania in the United States House of Representatives and later the Senate, then served as Minister to Russia under President Andrew Jackson. He was named Secretary of State under President James K. Polk, and as of 2016 is the last former Secretary of State to serve as President of the United States. After Buchanan turned down an offer to sit on the Supreme Court, President Franklin Pierce appointed him Ambassador to the United Kingdom, in which capacity he helped draft the Ostend Manifesto. Buchanan was nominated by the Democratic Party in the 1856 presidential election, on a ticket with former Kentucky Representative John C. Breckinridge, defeating both the incumbent President Pierce and Illinois Senator Stephen A. Douglas. Throughout most of Pierce's presidency, Buchanan had been stationed in London as minister to the Court of St. James's and so was not involved in the passage of the Kansas Nebraska Act, which further divided the country along sectional lines. His subsequent election victory took place in a three man race against Republican John C. Fremont and Know Nothing Millard Fillmore. As President, Buchanan allied with the South in attempting to gain the admission of Kansas to the Union as a slave state under the Lecompton Constitution. In the process, he alienated both Republican abolitionists and Northern Democrats, most of whom supported of popular sovereignty in determining a new state's slaveholding status. He was often called a doughface, a Northerner with Southern sympathies, and he fought severely with Stephen Douglas, the leader of the popular sovereignty faction, for control of the Democratic Party. Buchanan's efforts to maintain peace between the North and the South alienated both sides. Buchanan indicated in his 1857 inaugural address that he would not seek a second term; he kept his word, and supported Vice President John C. Breckinridge in 1860. In a four way contest, Republican nominee Abraham Lincoln was declared the winner, on a platform of keeping slavery out of all Western territories. In response, seven Southern states declared their secession from the Union, eventually leading to the American Civil War. Buchanan's view was that secession was illegal, but that going to war to stop it was also illegal. Thus, he did nothing to stop the Union from breaking apart. Buchanan, an attorney, was noted for his mantra, I acknowledge no master but the law. By the time he left office, popular opinion was against him and the Democratic Party had split. Despite failing to stop secession, Buchanan supported the United States during the Civil War. Shortly after the Union victory, he published his memoirs, Mr. Buchanan's Administration on the Eve of Rebellion, in 1866. He died in 1868 at age 77. Buchanan had once aspired to be a president who would rank in history with George Washington. However, his inability to identify a ground for peace or address the sharply divided pro slavery and anti slavery partisans with a unifying principle on the brink of the Civil War has led to his consistent ranking by historians as one of the worst presidents in American history. Historians in both 2006 and 2009 voted his failure to deal with secession the worst presidential mistake ever made. He is the only president from Pennsylvania and the only president to remain a lifelong bachelor. He was the last president born in the 18th century."
        },
        {
	    "rank": 16,
            "name": "Abrahan Lincoln",
            "dates": "1861-1865",
            "notes": "Abraham Lincoln was an American politician and lawyer who served as the 16th President of the United States from March 1861 until his assassination in April 1865. Lincoln led the United States through its Civil War its bloodiest war and perhaps its greatest moral, constitutional, and political crisis. In doing so, he preserved the Union, abolished slavery, strengthened the federal government, and modernized the economy. Born in Hodgenville, Kentucky, Lincoln grew up on the western frontier in Kentucky and Indiana. Largely self educated, he became a lawyer in Illinois, a Whig Party leader, and was elected to the Illinois House of Representatives, in which he served for eight years. Elected to the United States House of Representatives in 1846, Lincoln promoted rapid modernization of the economy through banks, tariffs, and railroads. Because he had originally agreed not to run for a second term in Congress, and because his opposition to the Mexican American War was unpopular among Illinois voters, Lincoln returned to Springfield and resumed his successful law practice. Reentering politics in 1854, he became a leader in building the new Republican Party, which had a statewide majority in Illinois. In 1858, while taking part in a series of highly publicized debates with his opponent and rival, Democrat Stephen A. Douglas, Lincoln spoke out against the expansion of slavery, but lost the U.S. Senate race to Douglas. In 1860, Lincoln secured the Republican Party presidential nomination as a moderate from a swing state. Though he gained very little support in the slaveholding states of the South, he swept the North and was elected president in 1860. Lincoln's victory prompted seven southern slave states to form the Confederate States of America before he moved into the White House no compromise or reconciliation was found regarding slavery and secession. Subsequently, on April 12, 1861, a Confederate attack on Fort Sumter inspired the North to enthusiastically rally behind the Union. As the leader of the moderate faction of the Republican Party, Lincoln confronted Radical Republicans, who demanded harsher treatment of the South, War Democrats, who called for more compromise, anti war Democrats (called Copperheads), who despised him, and irreconcilable secessionists, who plotted his assassination. Politically, Lincoln fought back by pitting his opponents against each other, by carefully planned political patronage, and by appealing to the American people with his powers of oratory. His Gettysburg Address became an iconic endorsement of the principles of nationalism, republicanism, equal rights, liberty, and democracy. Lincoln initially concentrated on the military and political dimensions of the war. His primary goal was to reunite the nation. He suspended habeas corpus, leading to the controversial ex parte Merryman decision, and he averted potential British intervention in the war by defusing the Trent Affair in late 1861. Lincoln closely supervised the war effort, especially the selection of top generals, including his most successful general, Ulysses S. Grant. He also made major decisions on Union war strategy, including a naval blockade that shut down the South's normal trade, moves to take control of Kentucky and Tennessee, and using gunboats to gain control of the southern river system. Lincoln tried repeatedly to capture the Confederate capital at Richmond; each time a general failed, Lincoln substituted another, until finally Grant succeeded. As the war progressed, his complex moves toward ending slavery included the Emancipation Proclamation of 1863; Lincoln used the U.S. Army to protect escaped slaves, encouraged the border states to outlaw slavery, and pushed through Congress the Thirteenth Amendment to the United States Constitution, which permanently outlawed slavery. An exceptionally astute politician deeply involved with power issues in each state, Lincoln reached out to the War Democrats and managed his own reelection campaign in the 1864 presidential election. Anticipating the war's conclusion, Lincoln pushed a moderate view of Reconstruction, seeking to reunite the nation speedily through a policy of generous reconciliation in the face of lingering and bitter divisiveness. On April 14, 1865, five days after the April 9th surrender of Confederate commanding general Robert E. Lee, Lincoln was assassinated by John Wilkes Booth, a Confederate sympathizer. Lincoln has been consistently ranked both by scholars and the public as among the three greatest U.S. presidents."
        },
        {
	    "rank": 17,
            "name": "Andrew Johnson",
            "dates": "1865-1869",
            "notes": "Andrew Johnson was the 17th President of the United States, serving from 1865 to 1869. Johnson became president as he was vice president at the time of the assassination of Abraham Lincoln."
        },
        {
	    "rank": 18,
            "name": "Ulysses S. Grant",
            "dates": "1869-1877",
            "notes": "Ulysses S. Grant was the 18th President of the United States. As Commanding General of the United States Army, Grant worked closely with President Abraham Lincoln to lead the Union Army to victory over the Confederacy in the American Civil War."
        },
        {
	    "rank": 19,
            "name": "Rutherford B. Hayes",
            "dates": "1877-1881",
            "notes": "Rutherford Birchard Hayes was the 19th President of the United States (1877 to 1881). As president, he oversaw the end of Reconstruction, began the efforts that led to civil service reform, and attempted to reconcile the divisions left over from the Civil War and Reconstruction."
        },
        {
	    "rank": 20,
            "name": "James A. Garfield",
            "dates": "1881-1881",
            "notes": "James Abram Garfield was the 20th President of the United States, serving from March 4, 1881, until his assassination later that year."
        },
        {
	    "rank": 21,
            "name": "Chester Alan Arthur",
            "dates": "1881-1885",
            "notes": "Chester Alan Arthur was an American attorney and politician who served as the 21st President of the United States; he succeeded James A. Garfield upon the latter's assassination."
        },
        {
	    "rank": 22,
            "name": "Stephen Grover Cleveland",
            "dates": "1885-1889",
            "notes": "Stephen Grover Cleveland was an American politician and lawyer who served as the 22nd and 24th President of the United States."
        },
        {
	    "rank": 23,
            "name": "Benjamin Harrison",
            "dates": "1889-1893",
            "notes": "Benjamin Harrison was an American politician and lawyer who served as the 23rd President of the United States from 1889 to 1893; he was the grandson of the ninth president, William Henry Harrison."
        },
        {
	    "rank": 24,
            "name": "Stephen Grover Cleveland",
            "dates": "1893-1897",
            "notes": "Stephen Grover Cleveland was an American politician and lawyer who served as the 22nd and 24th President of the United States."
        },
        {
	    "rank": 25,
            "name": "William McKinley",
            "dates": "1897-1901",
            "notes": "William McKinley was an American politician and lawyer who served as the 25th President of the United States from March 4, 1897, until his assassination in September 1901, six months into his second term."
        },
        {
	    "rank": 26,
            "name": "Theodore Roosevelt Jr.",
            "dates": "1901-1909",
            "notes": "Theodore Roosevelt Jr. was an American statesman, author, explorer, soldier, naturalist, and reformer who served as the 26th President of the United States from 1901 to 1909."
        },
        {
	    "rank": 27,
            "name": "William Howard Taft",
            "dates": "1909-1913",
            "notes": "William Howard Taft served as the 27th President of the United States and as the 10th Chief Justice of the United States, the only person to have held both offices."
        },
        {
	    "rank": 28,
            "name": "Thomas Woodrow Wilson",
            "dates": "1913-1921",
            "notes": "Thomas Woodrow Wilson, better known as Woodrow Wilson, was an American politician and academic who served as the 28th President of the United States from 1913 to 1921."
        },
        {
	    "rank": 29,
            "name": "Warren Gamaliel Harding",
            "dates": "1921-1923",
            "notes": "Warren Gamaliel Harding was the 29th President of the United States, serving from March 4, 1921 until his death in 1923."
        },
        {
	    "rank": 30,
            "name": "John Calvin Coolidge Jr.",
            "dates": "1923-1929",
            "notes": "John Calvin Coolidge Jr. was the 30th President of the United States. A Republican lawyer from Vermont, Coolidge worked his way up the ladder of Massachusetts state politics, eventually becoming governor of that state"
        },
        {
	    "rank": 31,
            "name": "Herbert Clark Hoover",
            "dates": "1929-1933",
            "notes": "Herbert Clark Hoover was an American politician who served as the 31st President of the United States from 1929 to 1933."
        },
        {
	    "rank": 32,
            "name": "Franklin Delano Roosevelt",
            "dates": "1933-1945",
            "notes": "Franklin Delano Roosevelt, commonly known as FDR, was an American statesman and political leader who served as the 32nd President of the United States, from 1933 to 1945."
        },
        {
	    "rank": 33,
            "name": "Harry S. Truman",
            "dates": "1945-1953",
            "notes": "Harry S. Truman was an American politician who served as the 33rd President of the United States (1945 to 1953). He served as a United States Senator from Missouri (1935 to 1945) and briefly as Vice President (1945) before he succeeded to the presidency on April 12, 1945 upon the death of Franklin D. Roosevelt. He was president during the final months of World War II, and approved the plan to drop atomic bombs on Hiroshima and Nagasaki. Truman was elected in his own right in 1948. He presided over an uncertain domestic scene as America sought its path after the war and tensions with the Soviet Union increased, marking the start of the Cold War."
        },
        {
	    "rank": 34,
            "name": "Dwight David Eisenhower",
            "dates": "1953-1961",
            "notes": "Dwight David Eisenhower was an American politician and general who served as the 34th President of the United States from 1953 until 1961."
        },
        {
	    "rank": 35,
            "name": "John Fitzgerald Kennedy",
            "dates": "1961-1963",
            "notes": "John Fitzgerald Kennedy, commonly referred to by his initials JFK, was an American politician who served as the 35th President of the United States from January 1961 until his assassination in November 1963."
        },
        {
	    "rank": 36,
            "name": "Lyndon Baines Johnson",
            "dates": "1963-1969",
            "notes": "Lyndon Baines Johnson, often referred to as LBJ, was an American politician who served as the 36th President of the United States from 1963 to 1969, assuming the office after serving as the 37th Vice President of the United States under President John F. Kennedy, from 1961 to 1963. Johnson was a Democrat from Texas, who served as a United States Representative from 1937 to 1949 and as a United States Senator from 1949 to 1961. He spent six years as Senate Majority Leader, two as Senate Minority Leader, and two as Senate Majority Whip."
        },
        {
	    "rank": 37,
            "name": "Richard Milhous Nixon",
            "dates": "1969-1974",
            "notes": "Richard Milhous Nixon was the 37th President of the United States who served from 1969 to 1974, when he became the only U.S. president to resign the office."
        },
        {
	    "rank": 38,
            "name": "Gerald Rudolph Ford Jr.",
            "dates": "1974-1977",
            "notes": "Gerald Rudolph Ford Jr. was an American politician who served as the 38th President of the United States from 1974 to 1977."
        },
        {
	    "rank": 39,
            "name": "James Earl Carter Jr.",
            "dates": "1977-1981",
            "notes": "James Earl Carter Jr. is an American politician and author who served as the 39th President of the United States from 1977 to 1981. In 2002, he was awarded the Nobel Peace Prize for his work with the Carter Center."
        },
        {
	    "rank": 40,
            "name": "Ronald Wilson Reagan",
            "dates": "1981-1989",
            "notes": "Ronald Wilson Reagan was an American politician and actor who served as the 40th President of the United States from 1981 to 1989."
        },
        {
	    "rank": 41,
            "name": "George Herbert Walker Bush",
            "dates": "1989-1993",
            "notes": "George Herbert Walker Bush is an American politician who was the 41st President of the United States from 1989 to 1993 and the 43rd Vice President of the United States from 1981 to 1989."
        },
        {
	    "rank": 42,
            "name": "William Jefferson Clinton",
            "dates": "1993-2001",
            "notes": "William Jefferson Clinton is an American politician who served as the 42nd President of the United States from 1993 to 2001. Clinton was Governor of Arkansas from 1979 to 1981 and 1983 to 1992, and Arkansas Attorney General from 1977 to 1979."
        },
        {
	    "rank": 43,
            "name": "George Walker Bush",
            "dates": "2001-2009",
            "notes": "George Walker Bush is an American politician who was the 43rd President of the United States from 2001 to 2009 and 46th Governor of Texas from 1995 to 2000. The eldest son of Barbara and George H. W. Bush, he was born in New Haven, Connecticut."
        },
        {
	    "rank": 44,
            "name": "Barack Hussein Obama II",
            "dates": "2009-2017",
            "notes": "Barack Hussein Obama II is an American politician who is the 44th and current President of the United States. He is the first African American to hold the office and the first president born outside the continental United States."
        }

    ]
}